<template>
  <div class="about">
    <div>
      <h1>
        岡田徹について紹介します
      </h1>
    </div>
    <div>
      <img src="./assets/profile.jpg" alt="profile" height="200px">
      <p>※この画像は高校生の頃のものであり実物とは異なります。</p>
    </div>
    <div>
      <p class="text-sm-left">1996年：さいたま市に生まれる</p>
      <p>2001年：両親が離婚→じいちゃんとばあいちゃんの家へ</p>
      <p>2001年：幼稚園入学。宇宙の図鑑をひたすら読んで、知識を披露する変わった子だった。よく怒られていたらしい。</p>
      <p>2004年：小学校入学。小３の頃、デュエル・マスターズで勝ちたすぎて親の金を10万盗みカードを箱買いする。その結果学校で最強に。家は貧乏で合ったのでお小遣いは友人の1/10以下。将来は金持ちになると誓う。</p>
      <p>2009年：公立中高一貫校に入学。河川敷でロケット花火の打ち合いなどする。ハンドボールを始め、先輩から「チームで一番下手くそだな」とdisられたのをきっかけに努力し埼玉県の優秀選手になる。</p>
      <p>2011年：高校入学。ハンドボールと勉強だけしていた。受験の神様的な存在の和田さんの本で「受験生はセックスしたら落ちる」的なことが書かれていたので、彼女を作らないと決心。童貞を守り抜いた。</p>
      <p>2015年：大阪大学経済学部入学。東大は前期で100点差くらいで落ちたので、後期で入った。英語を満点近く取りセンターがダメだった分を補う。ビリ３ぐらいで合格。</p>
      <p>2015年：ラクロス部に入るもなんか違かったので退部。やめると話しているのに、強い感じで引き止めてくるので半分うつ状態になる。その時にマネーの虎をみて起業家に憧れを持った。</p>
      <p>2016年：大学2年生、人生で初めて色々遊んだ。トーイックを勉強し九百点くらいとった。後半はakippa社で飛び込み営業のインターンをした。</p>
      <p>2017年：休学して、色々なことにトライした。自分でお金を稼いだ軽々がなかったので、阪大生限定の家庭教師の斡旋をスタートした。結果的には20万円くらいしか売上が立っていないが、バイト以外の方法で収益をあげる初めての経験をできた。その後、友人と「会食先をすぐに探せるチャットボット」や「趣味で繋がるライブ配信アプリ」など開発してみたが、本筋とは異なる人間関係や仕事に対する甘さなどより基礎的な部分が要因で失敗。</p>
      <p>2018年：東京に勇んで出てきたものの、友人とは解散。実力不足を認識し、知り合いの社長の会社でプログラミングスキルを磨く。1日15時間ほどコードを書きHTML、SCSS、JS、Rails、React等を習得する。その他、脱サラした優秀な起業家の先輩に諸々教わりつつ仕事の基礎力を身につける。</p>
      <p>現在：週末プロジェクトで進めていた、サイトM&Aのサービスがリリースできたため友人とプロジェクトを進めている。
      また、自分の幅を広げるためにVueでぬるぬる動くフロントを書いたりやSolidity等でDAppsの開発など進めている。</p>
    </div>
    <!-- <Card/> -->
  </div>
</template>

<script>
import Card from './components/contents/Card'

export default {
  components: {
    Card
  }
}
</script>

<style scoped>
.about {
  margin-top: 50px;
}
</style>
